<%@ page language="java" contentType="text/html; charset=UTF-8"
    pageEncoding="UTF-8"%>

<!doctype html>
<html lang="ko">
  <head>
    <%@ include file="../inc/head.jsp" %>
    <style type="text/css">
    	.container {
    		position: relative;
    		text-align: center;
    	}
    	
    	.agrment1 {
    		overflow:scroll; 
    		width:1000px; 
    		height:400px; 
    		padding:10px; 
    		background-color:#ffdc3c;
    		position: absolute;
    		top: 100px;
    		left: 85px;
    		margin:auto;
    		text-align: left;
    	}
  
    	.agrment2 {
    		overflow:scroll; 
    		width:1000px; 
    		height:400px; 
    		padding:10px; 
    		background-color:#ffdc3c;
    		position: absolute;
    		top: 670px;
    		left: 85px;
    		text-align: left;
    	}
    	
    	.agrtitle1 {
    		position: absolute;
    		top: 30px;
    		left: 85px;
    	}
    	
    	.agrtitle2 {
    		position: absolute;
    		top: 600px;
    		left: 85px;
    	}
    	
    	.agrmsg1-1 {
    		position: absolute;
    		top: 520px;
    		left: 85px;
    	}
    	
    	.agrmsg2-1 {
    		position: absolute;
    		top: 1090px;
    		left: 85px;
    	}
    	
    	.confirm {
    		width: 1170px;
    		height: 100px;
    		position: absolute;
    		top: 1200px;
    		text-align: center;
    	
    	}
    	
    	.all {
    		position: absolute;
    		top: 1150px;
    		display: inline-block;
    		
    	}
    	
    
    </style>
    
    
  </head>
  <body>
	<%@ include file="../inc/top.jsp" %>
	
	<div class="container"style="width: 1170px; height:1300px;">
	 
	<div class="agrtitle1"><h3> 이용약관</h3></div>
	 
	<div class="agrment1">
	 AGREEMENT1<br>
	 제 1장 총칙<br/><br/>

	제 1 조(목적)
	<br/><br/>
	본 약관은 국가공간정보포털 웹사이트(이하 "국가공간정보포털")가 제공하는 모든 서비스(이하 "서비스")의 이용조건 및 절차, 회원과 국가공간정보포털의 권리, 의무, 책임사항과 기타 필요한 사항을 규정함을 목적으로 합니다.
	<br/>
	제 2 조(약관의 효력과 변경)
	<br/><br/>
	1. 국가공간정보포털은 이용자가 본 약관 내용에 동의하는 경우, 국가공간정보포털의 서비스 제공 행위 및 회원의 서비스 사용 행위에 본 약관이 우선적으로 적용됩니다.<br/>
	2. 국가공간정보포털은 약관을 개정할 경우, 적용일자 및 개정사유를 명시하여 현행약관과 함께 국가공간정보포털의 초기화면에 그 적용일 7일 이전부터 적용 전일까지 공지합니다. 단, 회원에 불리하게 약관내용을 변경하는 경우에는 최소한 30일 이상의 사전 유예기간을 두고 공지합니다. 이 경우 국가공간정보포털은 개정 전 내용과 개정 후 내용을 명확하게 비교하여 회원이 알기 쉽도록 표시합니다.<br/>
	3. 변경된 약관은 국가공간정보포털 홈페이지에 공지하거나 e-mail을 통해 회원에게 공지하며, 약관의 부칙에 명시된 날부터 그 효력이 발생됩니다. 회원이 변경된 약관에 동의하지 않는 경우, 회원은 본인의 회원등록을 취소(회원탈퇴)할 수 있으며, 변경된 약관의 효력 발생일로부터 7일 이내에 거부의사를 표시하지 아니하고 서비스를 계속 사용할 경우는 약관 변경에 대한 동의로 간주됩니다.<br/>

	제 3 조(약관 외 준칙)<br/><br/>

	본 약관에 명시되지 않은 사항은 전기통신기본법, 전기통신사업법, 정보통신윤리위원회심의규정, 정보통신 윤리강령, 프로그램보호법 및 기타 관련 법령의 규정에 의합니다.<br/>

	제 4 조(용어의 정의)<br/><br/>

	본 약관에서 사용하는 용어의 정의는 다음과 같습니다.<br/>
	1. 이용자 : 본 약관에 따라 국가공간정보포털이 제공하는 서비스를 받는 자<br/>
	2. 가입 : 국가공간정보포털이 제공하는 신청서 양식에 해당 정보를 기입하고, 본 약관에 동의하여 서비스 이용계약을 완료시키는 행위<br/>
	3. 회원 : 국가공간정보포털에 개인 정보를 제공하여 회원 등록을 한 자로서 국가공간정보포털이 제공하는 서비스를 이용할 수 있는 자.<br/>
	4. 계정(ID) : 회원의 식별과 회원의 서비스 이용을 위하여 회원이 선정하고 국가공간정보포털에서 부여하는 문자와 숫자의 조합<br/>
	5. 비밀번호 : 회원과 계정이 일치하는지를 확인하고 통신상의 자신의 비밀보호를 위하여 회원 자신이 선정한 문자와 숫자의 조합<br/>
	6. 탈퇴 : 회원이 이용계약을 종료시키는 행위<br/>
	7. 본 약관에서 정의하지 않은 용어는 개별서비스에 대한 별도 약관 및 이용규정에서 정의합니다.<br/>


	제 2장 서비스 제공 및 이용<br/><br/>

	제 5 조 (이용계약의 성립)<br/><br/>

	1. 이용계약은 이용자가 온라인으로 국가공간정보포털에서 제공하는 소정의 가입신청 양식에서 요구하는 사항을 기록하여 가입을 완료하는 것으로 성립됩니다.<br/>
	2. 국가공간정보포털은 다음 각 호에 해당하는 이용계약에 대하여는 가입을 취소할 수 있습니다.<br/>
	   1) 다른 사람의 명의를 사용하여 신청하였을 때<br/>
	   2) 이용계약 신청서의 내용을 허위로 기재하였거나 신청하였을 때<br/>
	   3) 다른 사람의 국가공간정보포털 서비스 이용을 방해하거나 그 정보를 도용하는 등의 행위를 하였을 때<br/>
 	  4) 국가공간정보포털을 이용하여 법령과 본 약관이 금지하는 행위를 하는 경우<br/>
 	  5) 기타 국가공간정보포털이 정한 이용신청요건이 미비 되었을 때<br/>

	제 6 조 (회원정보 사용에 대한 동의)<br/>

	1. 회원의 개인정보는 「공공기관의개인정보보호에관한법률」에 의해 보호됩니다.<br/>
	2. 국가공간정보포털의 회원 정보는 다음과 같이 사용, 관리, 보호됩니다.<br/>
 	  1) 개인정보의 사용 : 국가공간정보포털는 서비스 제공과 관련해서 수집된 회원의 신상정보를 본인의 승낙 없이 제3자에게 누설, 배포하지 않습 니다. 단, 전기통신기본법 등 법률의 규정에 의해 국가기관의 요구가 있는 경우, 범죄에 대한 수사상의 목적이 있거나 정보통신윤리위원회의 요청이 있는 경우 또는 기타 관계법령에서 정한 절차에 따른 요청이 있는 경우, 이용자 스스로 개인정보를 공개한 경우에는 그러 하지 않습니다.<br/>
 	  2) 개인정보의 관리 : 회원은 개인정보의 보호 및 관리를 위하여 서비스의 개인정보관리에서 수시로 회원의 개인정보를 수정/삭제할 수 있습니다.<br/>
	   3) 개인정보의 보호 : 회원의 개인정보는 오직 본인만이 열람/수정/삭제 할 수 있으며, 이는 전적으로 회원의 계정과 비밀번호에 의해 관리되고 있습니다. 따라서 타인에게 본인의 계정과 비밀번호를 알려주어서는 안되며, 작업 종료시에는 반드시 로그아웃해 주시기 바랍니다.<br/>
	3. 회원이 본 약관에 따라 이용신청을 하는 것은, 국가공간정보포털의 신청서에 기재된 회원정보를 수집, 이용하는 것에 동의하는 것으로 간주 됩니다.<br/>
	 </div>
	 
	 
	 <div class="agrmsg1-1">
	 	<input class="agree" type="checkbox" /> <span>&nbsp; 위의 이용약관에 동의합니다. </span> <br/>
	 </div>
	 
	 <div class="agrtitle2"><h3>개인정보 수집 및 이용에 대한 안내</h3></div>
	 
	 <div class="agrment2">
	 AGREEMENT2<br>
	 제 1장 총칙<br/><br/>

	제 1 조(목적)
	<br/><br/>
	본 약관은 국가공간정보포털 웹사이트(이하 "국가공간정보포털")가 제공하는 모든 서비스(이하 "서비스")의 이용조건 및 절차, 회원과 국가공간정보포털의 권리, 의무, 책임사항과 기타 필요한 사항을 규정함을 목적으로 합니다.
	<br/>
	제 2 조(약관의 효력과 변경)
	<br/><br/>
	1. 국가공간정보포털은 이용자가 본 약관 내용에 동의하는 경우, 국가공간정보포털의 서비스 제공 행위 및 회원의 서비스 사용 행위에 본 약관이 우선적으로 적용됩니다.<br/>
	2. 국가공간정보포털은 약관을 개정할 경우, 적용일자 및 개정사유를 명시하여 현행약관과 함께 국가공간정보포털의 초기화면에 그 적용일 7일 이전부터 적용 전일까지 공지합니다. 단, 회원에 불리하게 약관내용을 변경하는 경우에는 최소한 30일 이상의 사전 유예기간을 두고 공지합니다. 이 경우 국가공간정보포털은 개정 전 내용과 개정 후 내용을 명확하게 비교하여 회원이 알기 쉽도록 표시합니다.<br/>
	3. 변경된 약관은 국가공간정보포털 홈페이지에 공지하거나 e-mail을 통해 회원에게 공지하며, 약관의 부칙에 명시된 날부터 그 효력이 발생됩니다. 회원이 변경된 약관에 동의하지 않는 경우, 회원은 본인의 회원등록을 취소(회원탈퇴)할 수 있으며, 변경된 약관의 효력 발생일로부터 7일 이내에 거부의사를 표시하지 아니하고 서비스를 계속 사용할 경우는 약관 변경에 대한 동의로 간주됩니다.<br/>

	제 3 조(약관 외 준칙)<br/><br/>

	본 약관에 명시되지 않은 사항은 전기통신기본법, 전기통신사업법, 정보통신윤리위원회심의규정, 정보통신 윤리강령, 프로그램보호법 및 기타 관련 법령의 규정에 의합니다.<br/>

	제 4 조(용어의 정의)<br/><br/>

	본 약관에서 사용하는 용어의 정의는 다음과 같습니다.<br/>
	1. 이용자 : 본 약관에 따라 국가공간정보포털이 제공하는 서비스를 받는 자<br/>
	2. 가입 : 국가공간정보포털이 제공하는 신청서 양식에 해당 정보를 기입하고, 본 약관에 동의하여 서비스 이용계약을 완료시키는 행위<br/>
	3. 회원 : 국가공간정보포털에 개인 정보를 제공하여 회원 등록을 한 자로서 국가공간정보포털이 제공하는 서비스를 이용할 수 있는 자.<br/>
	4. 계정(ID) : 회원의 식별과 회원의 서비스 이용을 위하여 회원이 선정하고 국가공간정보포털에서 부여하는 문자와 숫자의 조합<br/>
	5. 비밀번호 : 회원과 계정이 일치하는지를 확인하고 통신상의 자신의 비밀보호를 위하여 회원 자신이 선정한 문자와 숫자의 조합<br/>
	6. 탈퇴 : 회원이 이용계약을 종료시키는 행위<br/>
	7. 본 약관에서 정의하지 않은 용어는 개별서비스에 대한 별도 약관 및 이용규정에서 정의합니다.<br/>

	제 2장 서비스 제공 및 이용<br/><br/>

	제 5 조 (이용계약의 성립)<br/><br/>

	1. 이용계약은 이용자가 온라인으로 국가공간정보포털에서 제공하는 소정의 가입신청 양식에서 요구하는 사항을 기록하여 가입을 완료하는 것으로 성립됩니다.<br/>
	2. 국가공간정보포털은 다음 각 호에 해당하는 이용계약에 대하여는 가입을 취소할 수 있습니다.<br/>
	 1) 다른 사람의 명의를 사용하여 신청하였을 때<br/>
  	 2) 이용계약 신청서의 내용을 허위로 기재하였거나 신청하였을 때<br/>
  	 3) 다른 사람의 국가공간정보포털 서비스 이용을 방해하거나 그 정보를 도용하는 등의 행위를 하였을 때<br/>
  	 4) 국가공간정보포털을 이용하여 법령과 본 약관이 금지하는 행위를 하는 경우<br/>
  	 5) 기타 국가공간정보포털이 정한 이용신청요건이 미비 되었을 때<br/>

	제 6 조 (회원정보 사용에 대한 동의)<br/>

	1. 회원의 개인정보는 「공공기관의개인정보보호에관한법률」에 의해 보호됩니다.<br/>
	2. 국가공간정보포털의 회원 정보는 다음과 같이 사용, 관리, 보호됩니다.<br/>
	  1) 개인정보의 사용 : 국가공간정보포털는 서비스 제공과 관련해서 수집된 회원의 신상정보를 본인의 승낙 없이 제3자에게 누설, 배포하지 않습 니다. 단, 전기통신기본법 등 법률의 규정에 의해 국가기관의 요구가 있는 경우, 범죄에 대한 수사상의 목적이 있거나 정보통신윤리위원회의 요청이 있는 경우 또는 기타 관계법령에서 정한 절차에 따른 요청이 있는 경우, 이용자 스스로 개인정보를 공개한 경우에는 그러 하지 않습니다.<br/>
 	  2) 개인정보의 관리 : 회원은 개인정보의 보호 및 관리를 위하여 서비스의 개인정보관리에서 수시로 회원의 개인정보를 수정/삭제할 수 있습니다.<br/>
	  3) 개인정보의 보호 : 회원의 개인정보는 오직 본인만이 열람/수정/삭제 할 수 있으며, 이는 전적으로 회원의 계정과 비밀번호에 의해 관리되고 있습니다. 따라서 타인에게 본인의 계정과 비밀번호를 알려주어서는 안되며, 작업 종료시에는 반드시 로그아웃해 주시기 바랍니다.<br/>
	3. 회원이 본 약관에 따라 이용신청을 하는 것은, 국가공간정보포털의 신청서에 기재된 회원정보를 수집, 이용하는 것에 동의하는 것으로 간주 됩니다.<br/>

	 </div>
	 
	 <div class="agrmsg2-1">
	 <form name="form1">
	 	<input class="agree" id="agree" type="checkbox" /> <span>&nbsp; 위의 개인정보 수집 및 이용에 대한 안내에 동의합니다.</span> <br/>
	</form>
	 </div>
	 
	 <div class="all"><input type='checkbox' id='all_check'>전체선택</div>
	 
	 <div class="confirm">
		 <button type="button" class="btn btn-lg" style="font-weight: bold; font-size: 23px;"><a href="10_Sign_up_i_d.jsp">확인</a></button>
		 &nbsp; 
		 <button type="button" class="btn btn-lg" style="font-weight: bold; font-size: 23px;"><a href="01_Main.jsp">취소</a></button>
	 </div>
	 </div>
	 
	 <script src="http://code.jquery.com/jquery-3.2.1.min.js"></script>
	 <script type="text/javascript">
        $(function() {
            /* `#all_check`의 선택 상태가 변경되었을 때의 이벤트 */
            $("#all_check").change(function() {
                // 모든 `.hobby`의 선택 상태를 `#all_check`와 동일하게 맞춘다.
                $(".agree").prop('checked', $(this).prop('checked'));
            });
            
        
       
    </script>
</body>
	 
	 
	
	
	<%@ include file="../inc/bottom.jsp" %>
  </body>
</html>